# DA3Net配置文件，yolo113为内部代号

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels] 
  n: [0.50, 0.25, 1024] # summary: 316 layers, 2,624,904 parameters, 2,624,888 gradients, 6.9 GFLOPs num_experts = 4 max_experts = 8 
  s: [0.50, 0.50, 1024] # summary: 316 layers, 9,428,520 parameters, 9,428,504 gradients, 22.6 GFLOPs num_experts = 8 max_experts = 16
  m: [0.50, 1.00, 512]  # summary: 346 layers, 18,280,712 parameters, 18,280,696 gradients, 68.8 GFLOPs num_experts = 16 max_experts = 32
  l: [1.00, 1.00, 512]  # summary: 596 layers, 27,679,504 parameters, 27,679,488 gradients, 106.9 GFLOPs num_experts = 16 max_experts = 32
  x: [1.00, 1.50, 512]  # summary: 596 layers, 62,090,672 parameters, 62,090,656 gradients, 238.5 GFLOPs num_experts = 24 max_experts = 48

backbone:
  # [from, repeats, module, args]              特征图大小
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2         320
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4        160
  - [-1, 2, TransMoVEV2, [256, 4, 3]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8        80
  - [-1, 2, TransMoVEV2, [512, 4, 3]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16     40
  - [-1, 2, TransMoVEV2, [512, 4, 3]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32    20
  - [-1, 2, TransMoVEV2, [1024, 4, 3]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)

